## Question 1
### Read in all 4 credit card transaction datasets and clean up the column names.

In [1]:
import pandas as pd
import numpy as np

In [16]:
card = pd.read_csv("data/CardBase.csv")
customer = pd.read_csv("data/CustomerBase.csv")
fraud = pd.read_csv("data/FraudBase.csv")
transaction = pd.read_csv("data/TransactionBase.csv")

In [17]:
customer.columns

Index(['Cust_ID', 'Age', 'Customer_Segment', 'Customer_Vintage_Group'], dtype='object')

In [18]:
customer = customer.rename(str.lower, axis = "columns").copy()

In [19]:
card.columns

Index(['Card_Number', 'Card_Family', 'Credit_Limit', 'Cust_ID'], dtype='object')

In [20]:
card = card.rename(str.lower, axis = "columns").copy()

In [21]:
fraud.columns

Index(['Transaction_ID', 'Fraud_Flag'], dtype='object')

In [22]:
fraud = fraud.rename(str.lower, axis = "columns").copy()

In [23]:
transaction.columns

Index(['Transaction_ID', 'Transaction_Date', 'Credit_Card_ID',
       'Transaction_Value', 'Transaction_Segment'],
      dtype='object')

In [24]:
transaction = transaction.rename(str.lower, axis = "columns").copy()

## Question 2
### Join the data containing card details and customer details by customer id, so that all records of card details and any matching records in customer details are kept.

In [45]:
card.head()

           card_number card_family  credit_limit  cust_id
0  8638-5407-3631-8196     Premium        530000  CC67088
1  7106-4239-7093-1515        Gold         18000  CC12076
2  6492-5655-8241-3530     Premium        596000  CC97173
3  2868-5606-5152-5706        Gold         27000  CC55858
4  1438-6906-2509-8219    Platinum        142000  CC90518

In [46]:
card.shape

(500, 4)

In [47]:
customer.head()

   cust_id  age customer_segment customer_vintage_group
0  CC25034   35          Diamond                    VG1
1  CC59625   22          Diamond                    VG1
2  CC69314   33          Diamond                    VG1
3  CC67036   46          Diamond                    VG1
4  CC25597   44          Diamond                    VG1

In [48]:
customer.shape

(5674, 4)

In [27]:
card_customer = card.merge(customer, how="left", on="cust_id")

In [28]:
card_customer

,card_number,card_family,credit_limit,cust_id,age,customer_segment,customer_vintage_group
0,8638-5407-3631-8196,Premium,530000,CC67088,27,Diamond,VG1
1,7106-4239-7093-1515,Gold,18000,CC12076,48,Gold,VG3
2,6492-5655-8241-3530,Premium,596000,CC97173,22,Diamond,VG1
3,2868-5606-5152-5706,Gold,27000,CC55858,30,Diamond,VG1
4,1438-6906-2509-8219,Platinum,142000,CC90518,50,Platinum,VG2
...,...,...,...,...,...,...,...
495,4708-4407-9601-6022,Premium,691000,CC64993,34,Diamond,VG1
496,6042-2856-7280-2925,Gold,33000,CC26787,46,Platinum,VG2
497,8706-3809-5167-3899,Premium,144000,CC32532,28,Platinum,VG2
498,9540-8558-5897-5046,Premium,830000,CC90246,35,Gold,VG3
499,5587-7265-8118-7718,Gold,24000,CC37803,21,Diamond,VG1

## Question 3
### Join the data containing fraud details with transaction details so all rows of both tables are kept. What does the resulting row number tell you?

In [43]:
fraud.head()

  transaction_id  fraud_flag
0   CTID50558449           1
1   CTID55936882           1
2   CTID63762180           1
3   CTID76723439           1
4   CTID21246201           1

In [42]:
fraud.shape

(109, 2)

In [44]:
transaction.head()

,transaction_id,transaction_date,credit_card_id,transaction_value,transaction_segment
0,CTID28830551,24-Apr-16,1629-9566-3285-2123,23649,SEG25
1,CTID45504917,11-Feb-16,3697-6001-4909-5350,26726,SEG16
2,CTID47312290,1-Nov-16,5864-4475-3659-1440,22012,SEG14
3,CTID25637718,28-Jan-16,5991-4421-8476-3804,37637,SEG17
4,CTID66743960,17-Mar-16,1893-8853-9900-8478,5113,SEG14

In [41]:
transaction.shape

(10000, 5)

In [39]:
transaction_fraud = transaction.merge(fraud, how="left", on="transaction_id")

In [40]:
transaction_fraud

,transaction_id,transaction_date,credit_card_id,transaction_value,transaction_segment,fraud_flag
0,CTID28830551,24-Apr-16,1629-9566-3285-2123,23649,SEG25,NaN
1,CTID45504917,11-Feb-16,3697-6001-4909-5350,26726,SEG16,NaN
2,CTID47312290,1-Nov-16,5864-4475-3659-1440,22012,SEG14,NaN
3,CTID25637718,28-Jan-16,5991-4421-8476-3804,37637,SEG17,NaN
4,CTID66743960,17-Mar-16,1893-8853-9900-8478,5113,SEG14,NaN
...,...,...,...,...,...,...
9995,CTID25037573,10-Jun-16,9157-2802-8374-1145,44280,SEG18,NaN
9996,CTID43832298,23-May-16,7416-4529-6690-5703,27163,SEG12,NaN
9997,CTID56532072,6-Aug-16,6699-2639-4522-6219,36424,SEG13,NaN
9998,CTID88101446,10-Oct-16,8341-5263-4582-7396,8464,SEG14,NaN
9999,CTID64730271,18-Jun-16,1947-8602-1695-7503,7606,SEG15,NaN

## Question 4
### [Harder] Join the data containing card details with transaction details so rows from the first which have matching ones in the second are returned.

### Hint: semi is not an allowed option for how in .merge(). You'll need to think about the process of a semi join and then perform each step.

In [54]:
card

             card_number card_family  credit_limit  cust_id
0    8638-5407-3631-8196     Premium        530000  CC67088
1    7106-4239-7093-1515        Gold         18000  CC12076
2    6492-5655-8241-3530     Premium        596000  CC97173
3    2868-5606-5152-5706        Gold         27000  CC55858
4    1438-6906-2509-8219    Platinum        142000  CC90518
..                   ...         ...           ...      ...
495  4708-4407-9601-6022     Premium        691000  CC64993
496  6042-2856-7280-2925        Gold         33000  CC26787
497  8706-3809-5167-3899     Premium        144000  CC32532
498  9540-8558-5897-5046     Premium        830000  CC90246
499  5587-7265-8118-7718        Gold         24000  CC37803

[500 rows x 4 columns]

In [50]:
transaction

,transaction_id,transaction_date,credit_card_id,transaction_value,transaction_segment
0,CTID28830551,24-Apr-16,1629-9566-3285-2123,23649,SEG25
1,CTID45504917,11-Feb-16,3697-6001-4909-5350,26726,SEG16
2,CTID47312290,1-Nov-16,5864-4475-3659-1440,22012,SEG14
3,CTID25637718,28-Jan-16,5991-4421-8476-3804,37637,SEG17
4,CTID66743960,17-Mar-16,1893-8853-9900-8478,5113,SEG14
...,...,...,...,...,...
9995,CTID25037573,10-Jun-16,9157-2802-8374-1145,44280,SEG18
9996,CTID43832298,23-May-16,7416-4529-6690-5703,27163,SEG12
9997,CTID56532072,6-Aug-16,6699-2639-4522-6219,36424,SEG13
9998,CTID88101446,10-Oct-16,8341-5263-4582-7396,8464,SEG14
9999,CTID64730271,18-Jun-16,1947-8602-1695-7503,7606,SEG15

In [60]:
# Perform an inner join to find common card_number
semi_table = card.merge(transaction, how="inner", left_on="card_number", right_on="credit_card_id")
semi_table

,card_number,card_family,credit_limit,cust_id,transaction_id,transaction_date,credit_card_id,transaction_value,transaction_segment
0,8638-5407-3631-8196,Premium,530000,CC67088,CTID85973577,13-Feb-16,8638-5407-3631-8196,31592,SEG21
1,8638-5407-3631-8196,Premium,530000,CC67088,CTID13215166,30-Oct-16,8638-5407-3631-8196,5894,SEG12
2,8638-5407-3631-8196,Premium,530000,CC67088,CTID41016745,9-May-16,8638-5407-3631-8196,20925,SEG11
3,8638-5407-3631-8196,Premium,530000,CC67088,CTID82512584,31-Aug-16,8638-5407-3631-8196,36556,SEG11
4,8638-5407-3631-8196,Premium,530000,CC67088,CTID97222954,25-Nov-16,8638-5407-3631-8196,36715,SEG18
...,...,...,...,...,...,...,...,...,...
9995,5587-7265-8118-7718,Gold,24000,CC37803,CTID76550379,11-Oct-16,5587-7265-8118-7718,23298,SEG15
9996,5587-7265-8118-7718,Gold,24000,CC37803,CTID58221219,12-Jan-16,5587-7265-8118-7718,49957,SEG18
9997,5587-7265-8118-7718,Gold,24000,CC37803,CTID73252195,8-Dec-16,5587-7265-8118-7718,13508,SEG25
9998,5587-7265-8118-7718,Gold,24000,CC37803,CTID72271256,5-Feb-16,5587-7265-8118-7718,624,SEG24
9999,5587-7265-8118-7718,Gold,24000,CC37803,CTID81265917,5-Apr-16,5587-7265-8118-7718,14019,SEG13

In [58]:
# Create a boolean series
in_both = card["card_number"].isin(semi_table["card_number"])
in_both
# It seems all cards have been used at least for one transaction since I get 500 rows returned

0      True
1      True
2      True
3      True
4      True
       ...
495    True
496    True
497    True
498    True
499    True
Name: card_number, Length: 500, dtype: bool

In [61]:
# Subset the left table
cards_in_both = card[in_both]
cards_in_both

             card_number card_family  credit_limit  cust_id
0    8638-5407-3631-8196     Premium        530000  CC67088
1    7106-4239-7093-1515        Gold         18000  CC12076
2    6492-5655-8241-3530     Premium        596000  CC97173
3    2868-5606-5152-5706        Gold         27000  CC55858
4    1438-6906-2509-8219    Platinum        142000  CC90518
..                   ...         ...           ...      ...
495  4708-4407-9601-6022     Premium        691000  CC64993
496  6042-2856-7280-2925        Gold         33000  CC26787
497  8706-3809-5167-3899     Premium        144000  CC32532
498  9540-8558-5897-5046     Premium        830000  CC90246
499  5587-7265-8118-7718        Gold         24000  CC37803

[500 rows x 4 columns]

## Question 5
### Read in hat_observations and split observation into two columns, hat_colour and hat_type.

### Hint: Look up the pandas documentation for .str.split()

In [63]:
hats = pd.read_csv("data/hat_observations.csv")
hats

    day  month  year        observation  observation_count
0    25     10  2019        black,beret                  7
1    11      9  2019       blue,top hat                 10
2     4     12  2018    green,santa hat                  9
3    18      6  2018        white,beret                  9
4    26      9  2018    black,santa hat                  1
..  ...    ...   ...                ...                ...
95   15      8  2018  purple,bucket hat                  8
96   26      1  2018   green,bowler hat                  5
97   15     11  2018      black,top hat                  7
98   14      9  2019       green,helmet                  4
99    1     10  2018        blue,fedora                  4

[100 rows x 5 columns]

In [80]:
hats["hat_colour"], hats["hat_type"] = hats["observation"].str.split(",", n = 1, expand = True).T.to_numpy()
hats

,day,month,year,observation,observation_count,hat_colour,hat_type
0,25,10,2019,"black,beret",7,black,beret
1,11,9,2019,"blue,top hat",10,blue,top hat
2,4,12,2018,"green,santa hat",9,green,santa hat
3,18,6,2018,"white,beret",9,white,beret
4,26,9,2018,"black,santa hat",1,black,santa hat
...,...,...,...,...,...,...,...
95,15,8,2018,"purple,bucket hat",8,purple,bucket hat
96,26,1,2018,"green,bowler hat",5,green,bowler hat
97,15,11,2018,"black,top hat",7,black,top hat
98,14,9,2019,"green,helmet",4,green,helmet
99,1,10,2018,"blue,fedora",4,blue,fedora

In [85]:
split_hats = hats.drop(columns=["observation"])
split_hats

    day  month  year  observation_count hat_colour    hat_type
0    25     10  2019                  7      black       beret
1    11      9  2019                 10       blue     top hat
2     4     12  2018                  9      green   santa hat
3    18      6  2018                  9      white       beret
4    26      9  2018                  1      black   santa hat
..  ...    ...   ...                ...        ...         ...
95   15      8  2018                  8     purple  bucket hat
96   26      1  2018                  5      green  bowler hat
97   15     11  2018                  7      black     top hat
98   14      9  2019                  4      green      helmet
99    1     10  2018                  4       blue      fedora

[100 rows x 6 columns]

## Question 6
### Unite day, month, and year columns into a column called date using a suitable separator. Then find the date where the most berets were observed.

### Hints:
### - you can use the .agg() function to combine columns
### - you may need to convert the data types of the columns you wish to combine

In [91]:
split_hats["date"] = pd.to_datetime(split_hats[["year", "month", "day"]])

In [92]:
split_hats

    day  month  year  observation_count hat_colour    hat_type       date
0    25     10  2019                  7      black       beret 2019-10-25
1    11      9  2019                 10       blue     top hat 2019-09-11
2     4     12  2018                  9      green   santa hat 2018-12-04
3    18      6  2018                  9      white       beret 2018-06-18
4    26      9  2018                  1      black   santa hat 2018-09-26
..  ...    ...   ...                ...        ...         ...        ...
95   15      8  2018                  8     purple  bucket hat 2018-08-15
96   26      1  2018                  5      green  bowler hat 2018-01-26
97   15     11  2018                  7      black     top hat 2018-11-15
98   14      9  2019                  4      green      helmet 2019-09-14
99    1     10  2018                  4       blue      fedora 2018-10-01

[100 rows x 7 columns]

In [94]:
split_hats_with_date = split_hats.drop(columns=["day", "month", "year"])
split_hats_with_date

    observation_count hat_colour    hat_type       date
0                   7      black       beret 2019-10-25
1                  10       blue     top hat 2019-09-11
2                   9      green   santa hat 2018-12-04
3                   9      white       beret 2018-06-18
4                   1      black   santa hat 2018-09-26
..                ...        ...         ...        ...
95                  8     purple  bucket hat 2018-08-15
96                  5      green  bowler hat 2018-01-26
97                  7      black     top hat 2018-11-15
98                  4      green      helmet 2019-09-14
99                  4       blue      fedora 2018-10-01

[100 rows x 4 columns]